01  WS-AREA-1 PIC 9(5) VALUE 0.
01  WS-AREA-2 PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
    ADD 1 TO WS-AREA-1.
    IF WS-AREA-1 > 100 THEN
        MOVE 0 TO WS-AREA-1
    END-IF
    DISPLAY WS-AREA-1
    ADD 1 TO WS-AREA-2
    IF WS-AREA-2 > 100 THEN
        MOVE 0 TO WS-AREA-2
    END-IF
    DISPLAY WS-AREA-2
    STOP RUN.